"use client";
import { useParams } from "next/navigation";
import CampaignPage, { CampaignProps } from "@/views/campaigns/CampaignPage";

export default function Campaign() {
  const params = useParams();
  const data: CampaignProps = {
    id: parseInt(params.id as string, 10),
    title: "درخواست برداشتن محدودیت اینترنت بین‌المللی در وضعیت جنگی",
    author: "محمد حسین غلامی",
    isSuccess: false,
    isSigned: true,
    signaturesCount: 1234,
    body: `جناب دکتر پزشکیان رئیس‌جمهور محترم و ریاست شورای عالی امنیت ملی جناب
            دکتر قالیباف ریاست محترم مجلس شورای اسلامی جناب دکتر مومنی وزیر
            محترم کشور و ریاست شورای امنیت کشور جناب دکتر سیمایی صراف وزیر محترم
            علوم و ریاست شورای سنجش و پذیرش دانشجو با سلام و احترام، اینجانبان،
            داوطلبان کنکور سراسری تیر ۱۴۰۴، با دغدغه‌ای عمیق نسبت به شرایط سخت و
            ناپایدار روانی و اجتماعی حاکم بر کشور، به استحضار می‌رسانیم که در
            روزهای اخیر، فشارهای روحی ناشی از وضعیت جنگی، تهدیدات امنیتی، فضای
            پراضطراب رسانه‌ای و تنش‌های منطقه‌ای، تأثیر قابل توجهی بر تمرکز،
            آمادگی و سلامت روانی داوطلبان کنکور سراسری تیر گذاشته است. در چنین
            شرایطی، برگزاری این آزمون سرنوشت‌ساز بدون در نظر گرفتن واقعیت‌های
            روانی حاکم، موجب اضطراب مضاعف و افت عملکرد داوطلبان خواهد شد و این
            موضوع می‌تواند تبعات منفی بلندمدتی برای خود داوطلبان و روند آموزش
            عالی کشور به همراه داشته باشد. لذا با احترام، از شما سروران گرامی
            تقاضا داریم تا دستور تعویق حداقل دو هفته‌ای زمان برگزاری کنکور
            سراسری تیر ۱۴۰۴ را صادر فرمایید تا ضمن آرام‌سازی فضای جامعه، فرصتی
            برای ترمیم روحی و روانی داوطلبان فراهم گردد. این تصمیم می‌تواند
            نشانه‌ای از همدلی مسئولان با نسل جوان و اهتمام جدی به عدالت آموزشی
            در شرایط بحرانی باشد. برگزاری کنکور سراسری در این شرایط، علاوه بر
            ایجاد اضطراب و نگرانی، سلامت جسمی و روانی داوطلبان را تهدید می‌کند.
            پیشاپیش از حسن توجه و تدبیر شما سروران گرامی سپاسگزاریم و امیدواریم
            صدای کنکوری‌ها شنیده شود. با آرزوی پیروزی و سرافرازی ایران عزیزمان`,
    from: "مردم ایران",
    startDate: "25 خرداد 1404",
    endDate: "7 بهمن 1404",
  };

  return <CampaignPage data={data} />;
}
